una1veritas/ARMWork/STM32Libraries/Utilities/STM32_Audio/STM3240_41_G_EVAL/stm324xg_clk_synthesizer_cs2200.c
  /* Re-enable the interrupt mechanism */
  __enable_irq();
  
  /* Return the verifying value: 0 (Passed) or 1 (Failed) */
  return result;
}

#ifdef VERIFY_WRITTENDATA
/**
  * @brief  CLK_SYNTH_ReadReg
  *         Reads the value of a register.
  * @param  Reg: register address to be written.
  * @retval Value read from the register (or 0xFF if opearation failed).
  */
uint8_t CLK_SYNTH_ReadReg(uint8_t Reg)
{
  uint32_t result = 0;
  uint32_t Timeout = 0;
  
  __disable_irq();

  /*!< While the bus is busy */
  Timeout = CLK_SYNTH_LONG_TIMEOUT;
  while(I2C_GetFlagStatus(CLK_SYNTH_I2C, I2C_FLAG_BUSY))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /* Start the config sequence */
  I2C_GenerateSTART(CLK_SYNTH_I2C, ENABLE);

  /* Test on EV5 and clear it */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CLK_SYNTH_I2C, I2C_EVENT_MASTER_MODE_SELECT))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /* Transmit the slave address and enable writing operation */
  I2C_Send7bitAddress(CLK_SYNTH_I2C, CLK_SYNTH_ADDRESS, I2C_Direction_Transmitter);

  /* Test on EV6 and clear it */
  Timeout = CLK_SYNTH_LONG_TIMEOUT;
  while (!I2C_CheckEvent(CLK_SYNTH_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }

  /* Transmit the register address to be read */
  I2C_SendData(CLK_SYNTH_I2C, Reg);

  /* Test on EV8 and clear it */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while (I2C_GetFlagStatus(CLK_SYNTH_I2C, I2C_FLAG_BTF) == RESET)
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /*!< Send STRAT condition a second time */  
  I2C_GenerateSTART(CLK_SYNTH_I2C, ENABLE);
  
  /*!< Test on EV5 and clear it (cleared by reading SR1 then writing to DR) */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while(!I2C_CheckEvent(CLK_SYNTH_I2C, I2C_EVENT_MASTER_MODE_SELECT))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  } 
  
  /*!< Send Codec address for read */
  I2C_Send7bitAddress(CLK_SYNTH_I2C, CLK_SYNTH_ADDRESS, I2C_Direction_Receiver);  
  
  /* Wait on ADDR flag to be set (ADDR is still not cleared at this level */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while(I2C_GetFlagStatus(CLK_SYNTH_I2C, I2C_FLAG_ADDR) == RESET)
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }     
  
  /*!< Disable Acknowledgement */
  I2C_AcknowledgeConfig(CLK_SYNTH_I2C, DISABLE);   
  
  /* Clear ADDR register by reading SR1 then SR2 register (SR1 has already been read) */
  (void)CLK_SYNTH_I2C->SR2;
  
  /*!< Send STOP Condition */
  I2C_GenerateSTOP(CLK_SYNTH_I2C, ENABLE);
  
  /* Wait for the byte to be received */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while(I2C_GetFlagStatus(CLK_SYNTH_I2C, I2C_FLAG_RXNE) == RESET)
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /*!< Read the byte received from the Codec */
  result = I2C_ReceiveData(CLK_SYNTH_I2C);
  
  /* Wait to make sure that STOP flag has been cleared */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while(CLK_SYNTH_I2C->CR1 & I2C_CR1_STOP)
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }  
  
  /*!< Re-Enable Acknowledgement to be ready for another reception */
  I2C_AcknowledgeConfig(CLK_SYNTH_I2C, ENABLE);  
  
  /* Clear AF flag for next communication */
  I2C_ClearFlag(CLK_SYNTH_I2C, I2C_FLAG_AF); 

  /* Re-enable the interrupt mechanism */
  __enable_irq();
  
  /* Return the byte read from Codec */
  return result;
}
#endif /* VERIFY_WRITTENDATA */

/**
  * @brief  CLK_SYNTH_WriteBuff
  *         Writes a value to a register.
  * @param  pBuf: Buffer from which data should be sent.
  * @param  Size: Number of bytes to be sent.
  * @retval 0 if passed. !0 if error occured during operation.
  */
uint8_t CLK_SYNTH_WriteBuff(uint8_t* pBuf, uint32_t Size)
{
  uint32_t result = 0;
  uint32_t Timeout = 0;
  
  /* Init DMA for Transmission */
  DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;  
  DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)pBuf;
  DMA_InitStructure.DMA_BufferSize = Size;
  DMA_Init(CLK_SYNTH_I2C_DMA_STREAM_TX, &DMA_InitStructure);   
  
  /*!< While the bus is busy */
  Timeout = CLK_SYNTH_LONG_TIMEOUT;
  while(I2C_GetFlagStatus(CLK_SYNTH_I2C, I2C_FLAG_BUSY))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /* Start the config sequence */
  I2C_GenerateSTART(CLK_SYNTH_I2C, ENABLE);

  /* Test on EV5 and clear it */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CLK_SYNTH_I2C, I2C_EVENT_MASTER_MODE_SELECT))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /* Transmit the slave address and enable writing operation */
  I2C_Send7bitAddress(CLK_SYNTH_I2C, CLK_SYNTH_ADDRESS, I2C_Direction_Transmitter);

  /* Test on EV6 and clear it */
  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  while (!I2C_CheckEvent(CLK_SYNTH_I2C, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();
  }
  
  /* Enable DMA TX Channel */
  DMA_Cmd(CLK_SYNTH_I2C_DMA_STREAM_TX, ENABLE);  
  
  /* I2Cx DMA Enable */
  I2C_DMACmd(CLK_SYNTH_I2C, ENABLE);

#ifndef USE_I2C_DMA_TC_IT  
  /* Wait until DMA Transfer Complete or time out */
  Timeout = CLK_SYNTH_LONG_TIMEOUT;
  while (DMA_GetFlagStatus(CLK_SYNTH_I2C_DMA_STREAM_TX, CLK_SYNTH_I2C_TX_DMA_TCFLAG) == RESET)
  {
    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();   
  }
  
  /* I2C DMA Disable */
  I2C_DMACmd(CLK_SYNTH_I2C, DISABLE);
  
  ///  /* Wait until BTF Flag is set before generating STOP or time out */
  //  Timeout = CLK_SYNTH_FLAG_TIMEOUT;
  //  while (!I2C_GetFlagStatus(CLK_SYNTH_I2C, I2C_FLAG_BTF)) 
  //  {
  //    if((Timeout--) == 0) return CLK_SYNTH_TIMEOUT_UserCallback();   
  //  }
  
  /* Send STOP Condition */
  I2C_GenerateSTOP(CLK_SYNTH_I2C, ENABLE);

