una1veritas/ARMWork/STM32Libraries/Utilities/STM32_Audio/STM3240_41_G_EVAL/stm324xg_clk_synthesizer_cs2200.c
  /* If the I2C peripheral is already enabled, don't reconfigure it */
  if (CLK_SYNTH_I2C->CR1 & I2C_CR1_PE)
  {   
    /* CLK_SYNTH_I2C peripheral configuration */
    I2C_DeInit(CLK_SYNTH_I2C);
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = 0x33;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;
    
    /* Enable the I2C peripheral */
    I2C_Cmd(CLK_SYNTH_I2C, ENABLE);  
    I2C_Init(CLK_SYNTH_I2C, &I2C_InitStructure);
  }
}

/**
  * @brief Restore the control interface to its default state.
  *        This function doesn't de-initialize the I2C because the I2C peripheral
  *        may be used by other modules.
  * @param  None.
  * @retval None.
  */
static void CLK_SYNTH_CtrlInterface_DeInit(void)
{
  /* Disable the I2C peripheral */ /* This step is not done here because 
     the I2C interface can be used by other modules */
  /* I2C_DeInit(CLK_SYNTH_I2C); */
}

/**
  * @brief CLK_SYNTH_RefClk_Init
  *        Initialize the reference clock source.
  * @param  Freq: Reference clock source to be programmed in Hz.
  * @retval None.
  */
static void CLK_SYNTH_RefClk_Init(uint32_t Freq)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  /* Enable the SPI clock */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_SPI2, ENABLE);

  /* Configure the I2S_CKIN as Input */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
  
  /* Set the configuration of PC9 pin */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_Init(GPIOC, &GPIO_InitStructure);   
  
  /* Connect the AF pin to the I2S IPs */
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource9, GPIO_AF_SPI2);
  
  /* Set the External clock as source for the I2S IP */
  RCC->CFGR |= (uint32_t)RCC_CFGR_I2SSRC;  
  
  /* Enable the GPIOA peripheral */ 
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
  
  /* Configure MCO1 pin(PA8) in alternate function */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;  
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  /* Connect the AF pin to the MCO function */
  GPIO_PinAFConfig(GPIOA, GPIO_PinSource8, GPIO_AF_MCO); 
  
  /* PLL clock selected to output on MCO1 pin(PA8)*/
  RCC_MCO1Config(RCC_MCO1Source_PLLCLK, RCC_MCO1Div_3); /* Reference Clk= 120MHz/3 = 40MHz */
}

/**
  * @brief  CLK_SYNTH_RefClk_DeInit
  *         Restore the reference clock source state to default.
  * @param  None.
  * @retval None.
  */
static void CLK_SYNTH_RefClk_DeInit(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  /* Restore MCO1 pin(PA8) to default state */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;  
  GPIO_Init(GPIOA, &GPIO_InitStructure);
  
  /* HSI clock selected to output on MCO1 pin(PA8)*/
  RCC_MCO1Config(RCC_MCO1Source_HSI, RCC_MCO1Div_1);
}

#endif /* AUDIO_SYNCHRO_CLKSYNTH_ENABLED */
/**
* @}
*/ 

/**
* @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
